In [32]:
import numpy as np
import pandas as pd
se1 = pd.Series(range(4),index=['d','a','b','c'])
se1

d    0
a    1
b    2
c    3
dtype: int64

In [33]:
se1.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [34]:
se1.sort_index(ascending = False)#ascending = False 是由大到小

d    0
c    3
b    2
a    1
dtype: int64

In [35]:
frame  = pd.DataFrame(np.arange(8).reshape((2,4)),
             index=['three','one'],
             columns = ['d','c','a','b'])
frame

       d  c  a  b
three  0  1  2  3
one    4  5  6  7

In [36]:
frame.sort_index()

       d  c  a  b
one    4  5  6  7
three  0  1  2  3

In [37]:
frame.sort_index(axis =1,ascending = False)

       d  c  b  a
three  0  1  3  2
one    4  5  7  6

In [38]:
se2 = pd.Series([4,7,-3,2])
se2.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [39]:
se2.sort_values(ascending = False)

1    7
0    4
3    2
2   -3
dtype: int64

In [40]:
se3 = pd.Series([4, np.nan, 7, np.nan, -3, 2])
se3.sort_values(ascending=False)

2    7.0
0    4.0
5    2.0
4   -3.0
1    NaN
3    NaN
dtype: float64

In [41]:
frame2 = pd.DataFrame({'b':[4,7,-3,2],
              'a':[0,1,0,1]},
              index=[1,2,3,4])
frame2

   b  a
1  4  0
2  7  1
3 -3  0
4  2  1

In [59]:
frame2.sort_values(by='b')

   b  a
3 -3  0
4  2  1
1  4  0
2  7  1

In [60]:
frame2.sort_values(by=['a','b'])

   b  a
3 -3  0
1  4  0
4  2  1
2  7  1

In [51]:
frame2.sort_values(by=2,axis =1,ascending = False)

   b  a
1  4  0
2  7  1
3 -3  0
4  2  1

In [52]:
#rank()
se3 = pd.Series([7, -5, 7, 4, 2, 0, 4])
se3.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [53]:
display(se3)
se3.rank(ascending=False,method='first')

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

0    1.0
1    7.0
2    2.0
3    3.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [54]:
display(se3)
se3.rank(ascending=False,method='max')

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [55]:
display(se3)
se3.rank(ascending=False,method='min')

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

0    1.0
1    7.0
2    1.0
3    3.0
4    5.0
5    6.0
6    3.0
dtype: float64

In [56]:
frame = pd.DataFrame({'b':[4.3, 7, -3, 2],
                     'a':[0, 1, 0,1],
                     'c':[-2, 5, 8, -2.5]})
frame.sort_index(axis='columns').rank(axis='columns')

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0